import time
import os
import re
import base64
import requests
import cv2  # OpenCV库，用于视频流检测
import threading
from queue import Queue

# 线程安全的队列，用于存储下载任务
task_queue = Queue()

headers = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36'}

# 北京联通的组播地址
urls_beijing = ["Beijing"]
channelsx_beijing = [
    "CCTV-1 综合[高清],http://8.8.8.8:8/rtp/239.3.1.129:8008", 
    "CCTV-2 财经[高清],http://8.8.8.8:8/rtp/239.3.1.60:8084", 
    "CCTV-3 综艺[高清],http://8.8.8.8:8/rtp/239.3.1.172:8001", 
    "CCTV-4 中文国际[高清],http://8.8.8.8:8/rtp/239.3.1.105:8092", 
    "CCTV-4 中文国际 欧洲[高清],http://8.8.8.8:8/rtp/239.3.1.213:4220", 
    "CCTV-4 中文国际 美洲[高清],http://8.8.8.8:8/rtp/239.3.1.214:4220", 
    "CCTV-5 体育[高清],http://8.8.8.8:8/rtp/239.3.1.173:8001", 
    "CCTV-5+ 体育赛事[高清],http://8.8.8.8:8/rtp/239.3.1.130:8004", 
    "CCTV-6 电影[高清],http://8.8.8.8:8/rtp/239.3.1.174:8001", 
    "CCTV-7 国防军事[高清],http://8.8.8.8:8/rtp/239.3.1.61:8104", 
    "CCTV-8 电视剧[高清],http://8.8.8.8:8/rtp/239.3.1.175:8001", 
    "CCTV-9 纪录[高清],http://8.8.8.8:8/rtp/239.3.1.62:8112", 
    "CCTV-10 科教[高清],http://8.8.8.8:8/rtp/239.3.1.63:8116", 
    "CCTV-11 戏曲[高清],http://8.8.8.8:8/rtp/239.3.1.152:8120", 
    "CCTV-12 社会与法[高清],http://8.8.8.8:8/rtp/239.3.1.64:8124", 
    "CCTV-13 新闻[高清],http://8.8.8.8:8/rtp/239.3.1.124:8128", 
    "CCTV-14 少儿[高清],http://8.8.8.8:8/rtp/239.3.1.65:8132", 
    "CCTV-15 音乐[高清],http://8.8.8.8:8/rtp/239.3.1.153:8136", 
    "CCTV-16 奥林匹克[超清HDR],http://8.8.8.8:8/rtp/239.3.1.183:8001", 
    "CCTV-16 奥林匹克[高清],http://8.8.8.8:8/rtp/239.3.1.184:8001", 
    "CCTV-17 农业农村[高清],http://8.8.8.8:8/rtp/239.3.1.151:8144", 
    "CCTV-4K 超高清[超清HDR],http://8.8.8.8:8/rtp/239.3.1.245:2000", 
    "湖南卫视[高清],http://8.8.8.8:8/rtp/239.3.1.132:8012", 
    "东方卫视[高清],http://8.8.8.8:8/rtp/239.3.1.136:8032", 
    "浙江卫视[高清],http://8.8.8.8:8/rtp/239.3.1.137:8036", 
    "江苏卫视[高清],http://8.8.8.8:8/rtp/239.3.1.135:8028", 
    "深圳卫视[高清],http://8.8.8.8:8/rtp/239.3.1.134:8020", 
    "广东卫视[高清],http://8.8.8.8:8/rtp/239.3.1.142:8048", 
    "安徽卫视[高清],http://8.8.8.8:8/rtp/239.3.1.211:8064", 
    "天津卫视[高清],http://8.8.8.8:8/rtp/239.3.1.141:1234", 
    "重庆卫视[高清],http://8.8.8.8:8/rtp/239.3.1.122:8160", 
    "山东卫视[高清],http://8.8.8.8:8/rtp/239.3.1.209:8052", 
    "黑龙江卫视[高清],http://8.8.8.8:8/rtp/239.3.1.133:8016", 
    "河北卫视[高清],http://8.8.8.8:8/rtp/239.3.1.148:8072", 
    "辽宁卫视[高清],http://8.8.8.8:8/rtp/239.3.1.210:8056", 
    "湖北卫视[高清],http://8.8.8.8:8/rtp/239.3.1.138:8044", 
    "吉林卫视[高清],http://8.8.8.8:8/rtp/239.3.1.240:8172", 
    "贵州卫视[高清],http://8.8.8.8:8/rtp/239.3.1.149:8076", 
    "东南卫视[高清],http://8.8.8.8:8/rtp/239.3.1.156:8148", 
    "江西卫视[高清],http://8.8.8.8:8/rtp/239.3.1.123:8164", 
    "海南卫视,http://8.8.8.8:8/rtp/239.3.1.45:8304", 
    "云南卫视,http://8.8.8.8:8/rtp/239.3.1.26:8108", 
    "兵团卫视,http://8.8.8.8:8/rtp/239.3.1.144:4120", 
    "厦门卫视,http://8.8.8.8:8/rtp/239.3.1.143:4120", 
    "四川卫视,http://8.8.8.8:8/rtp/239.3.1.29:8288", 
    "大湾区卫视,http://8.8.8.8:8/rtp/239.3.1.161:8001", 
    "宁夏卫视,http://8.8.8.8:8/rtp/239.3.1.46:8124", 
    "山西卫视,http://8.8.8.8:8/rtp/239.3.1.42:8172", 
    "广西卫视,http://8.8.8.8:8/rtp/239.3.1.39:8300", 
    "新疆卫视,http://8.8.8.8:8/rtp/239.3.1.48:8160", 
    "河南卫视,http://8.8.8.8:8/rtp/239.3.1.27:8128", 
    "甘肃卫视,http://8.8.8.8:8/rtp/239.3.1.49:8188", 
    "西藏卫视,http://8.8.8.8:8/rtp/239.3.1.47:8164", 
    "三沙卫视,http://8.8.8.8:8/rtp/239.3.1.155:4120", 
    "陕西卫视,http://8.8.8.8:8/rtp/239.3.1.41:8140", 
    "青海卫视,http://8.8.8.8:8/rtp/239.3.1.44:8184", 
    "内蒙古卫视,http://8.8.8.8:8/rtp/239.3.1.43:8176", 
    "BRTV北京卫视[高清],http://8.8.8.8:8/rtp/239.3.1.241:8000", 
    "BRTV新闻[高清],http://8.8.8.8:8/rtp/239.3.1.159:8000", 
    "BRTV影视[高清],http://8.8.8.8:8/rtp/239.3.1.158:8000", 
    "BRTV文艺[高清],http://8.8.8.8:8/rtp/239.3.1.242:8000", 
    "BRTV财经[高清],http://8.8.8.8:8/rtp/239.3.1.116:8000", 
    "BRTV生活[高清],http://8.8.8.8:8/rtp/239.3.1.117:8000", 
    "BRTV青年[高清],http://8.8.8.8:8/rtp/239.3.1.118:8000", 
    "BRTV纪实科教[高清],http://8.8.8.8:8/rtp/239.3.1.115:8000", 
    "BRTV卡酷少儿[高清],http://8.8.8.8:8/rtp/239.3.1.189:8000", 
    "BRTV冬奥纪实[高清],http://8.8.8.8:8/rtp/239.3.1.243:8000", 
    "BRTV冬奥纪实[超清HDR],http://8.8.8.8:8/rtp/239.3.1.120:8000", 
    "BRTV冬奥纪实[超清],http://8.8.8.8:8/rtp/239.3.1.121:8000", 
    "BRTV体育休闲[高清],http://8.8.8.8:8/rtp/239.3.1.243:8000", 
    "BRTV国际频道[高清],http://8.8.8.8:8/rtp/239.3.1.235:8000", 
    "爱上4K[超清],http://8.8.8.8:8/rtp/239.3.1.236:2000", 
    "4K超清[超清],http://8.8.8.8:8/rtp/239.3.1.249:8001", 
    "淘电影[高清],http://8.8.8.8:8/rtp/239.3.1.250:8001", 
    "每日影院[高清],http://8.8.8.8:8/rtp/239.3.1.111:8001", 
    "星影,http://8.8.8.8:8/rtp/239.3.1.94:4120", 
    "动作影院,http://8.8.8.8:8/rtp/239.3.1.92:4120", 
    "光影,http://8.8.8.8:8/rtp/239.3.1.84:4120", 
    "喜剧影院,http://8.8.8.8:8/rtp/239.3.1.91:4120", 
    "家庭影院,http://8.8.8.8:8/rtp/239.3.1.93:4120", 
    "精选,http://8.8.8.8:8/rtp/239.3.1.74:4120", 
    "经典电影,http://8.8.8.8:8/rtp/239.3.1.195:9024", 
    "纪实人文[高清],http://8.8.8.8:8/rtp/239.3.1.212:8060", 
    "金鹰纪实[高清],http://8.8.8.8:8/rtp/239.3.1.58:8156", 
    "乐游[高清],http://8.8.8.8:8/rtp/239.3.1.207:8001", 
    "风尚生活[高清],http://8.8.8.8:8/rtp/239.3.1.114:8001", 
    "地理,http://8.8.8.8:8/rtp/239.3.1.71:4120", 
    "淘剧场[高清],http://8.8.8.8:8/rtp/239.3.1.95:8001", 
    "幸福剧场[高清],http://8.8.8.8:8/rtp/239.3.1.112:8001", 
    "都市剧场[高清],http://8.8.8.8:8/rtp/239.3.1.203:8001", 
    "淘娱乐[高清],http://8.8.8.8:8/rtp/239.3.1.100:8001", 
    "幸福娱乐[高清],http://8.8.8.8:8/rtp/239.3.1.113:8001", 
    "淘Baby[高清],http://8.8.8.8:8/rtp/239.3.1.238:8001", 
    "萌宠TV[高清],http://8.8.8.8:8/rtp/239.3.1.102:8001", 
    "动漫秀场[高清],http://8.8.8.8:8/rtp/239.3.1.202:8001", 
    "中国交通[高清],http://8.8.8.8:8/rtp/239.3.1.188:8001", 
    "朝阳融媒[高清],http://8.8.8.8:8/rtp/239.3.1.163:8001", 
    "通州融媒[高清],http://8.8.8.8:8/rtp/239.3.1.221:8001", 
    "密云电视台[高清],http://8.8.8.8:8/rtp/239.3.1.154:8001", 
    "房山电视台[高清],http://8.8.8.8:8/rtp/239.3.1.96:8001", 
    "延庆电视台,http://8.8.8.8:8/rtp/239.3.1.187:8001", 
    "法治天地[高清],http://8.8.8.8:8/rtp/239.3.1.204:8001", 
    "CGTN 新闻[高清],http://8.8.8.8:8/rtp/239.3.1.215:4220", 
    "CGTN 记录[高清],http://8.8.8.8:8/rtp/239.3.1.216:4220", 
    "CGTN 西班牙语[高清],http://8.8.8.8:8/rtp/239.3.1.217:4220", 
    "CGTN 法语[高清],http://8.8.8.8:8/rtp/239.3.1.218:4220", 
    "CGTN 阿拉伯语[高清],http://8.8.8.8:8/rtp/239.3.1.219:4220", 
    "CGTN 俄语[高清],http://8.8.8.8:8/rtp/239.3.1.220:4220", 
    "睛彩竞技[高清],http://8.8.8.8:8/rtp/239.3.1.125:8001", 
    "睛彩篮球[高清],http://8.8.8.8:8/rtp/239.3.1.126:8001", 
    "睛彩羽毛球[高清],http://8.8.8.8:8/rtp/239.3.1.127:8001", 
    "睛彩广场舞[高清],http://8.8.8.8:8/rtp/239.3.1.128:8001", 
    "魅力足球[高清],http://8.8.8.8:8/rtp/239.3.1.201:8001", 
    "茶频道[高清],http://8.8.8.8:8/rtp/239.3.1.165:8001", 
    "淘精彩[高清],http://8.8.8.8:8/rtp/239.3.1.178:8001", 
    "快乐垂钓[高清],http://8.8.8.8:8/rtp/239.3.1.164:8001", 
    "生活时尚[高清],http://8.8.8.8:8/rtp/239.3.1.206:8001", 
    "游戏风云[高清],http://8.8.8.8:8/rtp/239.3.1.205:8001", 
    "金色学堂[高清],http://8.8.8.8:8/rtp/239.3.1.208:8001", 
    "CETV1[高清],http://8.8.8.8:8/rtp/239.3.1.57:8152", 
    "CETV2,http://8.8.8.8:8/rtp/239.3.1.54:4120", 
    "CETV3,http://8.8.8.8:8/rtp/239.3.1.55:4120", 
    "CETV4,http://8.8.8.8:8/rtp/239.3.1.56:4120", 
    "少儿动画,http://8.8.8.8:8/rtp/239.3.1.199:9000", 
    "热播剧场,http://8.8.8.8:8/rtp/239.3.1.194:9020", 
    "解密,http://8.8.8.8:8/rtp/239.3.1.75:4120", 
    "军事,http://8.8.8.8:8/rtp/239.3.1.76:4120", 
    "军旅剧场,http://8.8.8.8:8/rtp/239.3.1.68:4120", 
    "动画,http://8.8.8.8:8/rtp/239.3.1.80:4120", 
    "古装剧场,http://8.8.8.8:8/rtp/239.3.1.69:4120", 
    "嘉佳卡通,http://8.8.8.8:8/rtp/239.3.1.147:9268", 
    "国学,http://8.8.8.8:8/rtp/239.3.1.77:4120", 
    "城市剧场,http://8.8.8.8:8/rtp/239.3.1.67:4120", 
    "墨宝,http://8.8.8.8:8/rtp/239.3.1.83:4120", 
    "好学生,http://8.8.8.8:8/rtp/239.3.1.81:4120", 
    "山东教育,http://8.8.8.8:8/rtp/239.3.1.52:4120", 
    "戏曲,http://8.8.8.8:8/rtp/239.3.1.78:4120", 
    "早教,http://8.8.8.8:8/rtp/239.3.1.79:4120", 
    "武侠剧场,http://8.8.8.8:8/rtp/239.3.1.90:4120", 
    "武术,http://8.8.8.8:8/rtp/239.3.1.87:4120", 
    "爱生活,http://8.8.8.8:8/rtp/239.3.1.86:4120", 
    "美人,http://8.8.8.8:8/rtp/239.3.1.73:4120", 
    "美妆,http://8.8.8.8:8/rtp/239.3.1.72:4120", 
    "财富天下,http://8.8.8.8:8/rtp/239.3.1.53:9136", 
    "足球,http://8.8.8.8:8/rtp/239.3.1.89:4120", 
    "金鹰卡通,http://8.8.8.8:8/rtp/239.3.1.51:9252", 
    "鉴赏,http://8.8.8.8:8/rtp/239.3.1.82:4120", 
    "音乐现场,http://8.8.8.8:8/rtp/239.3.1.70:4120", 
    "魅力时尚,http://8.8.8.8:8/rtp/239.3.1.196:9012", 
]

# 湖南电信的组播地址
urls_hunan = ["changsha", "zhuzhou", "xiangtan", "hengyang", "shaoyang", "yueyang", "changde", "zhangjiajie", 
              "yiyang", "chenzhou", "yongzhou", "huaihua", "loudi"]
channelsx_hunan = [
   "湖南卫视,http://8.8.8.8:8/udp/239.76.245.115:1234", "湖南经视,http://8.8.8.8:8/udp/239.76.245.116:1234",
    "湖南都市,http://8.8.8.8:8/udp/239.76.245.117:1234", "湖南电视剧,http://8.8.8.8:8/udp/239.76.245.118:1234",
    "湖南电影,http://8.8.8.8:8/udp/239.76.245.119:1234", "湖南娱乐,http://8.8.8.8:8/udp/239.76.245.121:1234",
    "湖南国际,http://8.8.8.8:8/udp/239.76.245.124:1234", "湖南公共,http://8.8.8.8:8/udp/239.76.245.123:1234",
    "CCTV1,http://8.8.8.8:8/udp/239.76.245.51:1234", "CCTV1,http://8.8.8.8:8/udp/239.76.246.151:1234",
    "CCTV2,http://8.8.8.8:8/udp/239.76.246.152:1234", "CCTV3,http://8.8.8.8:8/udp/239.76.246.153:1234",
    "CCTV4,http://8.8.8.8:8/udp/239.76.245.195:1234", "CCTV4,http://8.8.8.8:8/udp/239.76.246.154:1234",
    "CCTV5,http://8.8.8.8:8/udp/239.76.246.155:1234", "CCTV5+,http://8.8.8.8:8/udp/239.76.246.168:1234",
    "CCTV6,http://8.8.8.8:8/udp/239.76.246.156:1234", "CCTV7,http://8.8.8.8:8/udp/239.76.246.157:1234",
    "CCTV8,http://8.8.8.8:8/udp/239.76.246.158:1234", "CCTV9,http://8.8.8.8:8/udp/239.76.246.159:1234",
    "CCTV10,http://8.8.8.8:8/udp/239.76.246.160:1234", "CCTV11,http://8.8.8.8:8/udp/239.76.245.251:1234",
    "CCTV12,http://8.8.8.8:8/udp/239.76.246.162:1234", "CCTV13,http://8.8.8.8:8/udp/239.76.246.93:1234",
    "CCTV14,http://8.8.8.8:8/udp/239.76.246.164:1234", "CCTV15,http://8.8.8.8:8/udp/239.76.245.252:1234",
    "CCTV16,http://8.8.8.8:8/udp/239.76.246.98:1234", "CCTV17,http://8.8.8.8:8/udp/239.76.245.238:1234",
    "CCTV 4K,http://8.8.8.8:8/udp/239.76.246.214:1234", "CCTV16 4k,http://8.8.8.8:8/udp/239.76.246.224:1234",
    "CCTV16 4k,http://8.8.8.8:8/udp/239.76.246.230:1234", "体育,http://8.8.8.8:8/udp/239.76.246.136:1234",
    "金鹰卡通,http://8.8.8.8:8/udp/239.76.245.120:1234", "金鹰纪实,http://8.8.8.8:8/udp/239.76.245.122:1234",
    "快乐垂钓,http://8.8.8.8:8/udp/239.76.245.127:1234", "湖南教育,http://8.8.8.8:8/udp/239.76.245.233:1234",
    "茶频道,http://8.8.8.8:8/udp/239.76.245.239:1234", "广东卫视,http://8.8.8.8:8/udp/239.76.245.189:1234",
    "东南卫视,http://8.8.8.8:8/udp/239.76.245.190:1234", "安徽卫视,http://8.8.8.8:8/udp/239.76.245.196:1234",
    "辽宁卫视,http://8.8.8.8:8/udp/239.76.245.197:1234", "江西卫视,http://8.8.8.8:8/udp/239.76.245.225:1234",
    "河北卫视,http://8.8.8.8:8/udp/239.76.245.199:1234", "贵州卫视,http://8.8.8.8:8/udp/239.76.245.198:1234",
    "江苏卫视,http://8.8.8.8:8/udp/239.76.246.181:1234", "东方卫视,http://8.8.8.8:8/udp/239.76.246.186:1234",
    "浙江卫视,http://8.8.8.8:8/udp/239.76.246.182:1234", "北京卫视,http://8.8.8.8:8/udp/239.76.246.184:1234",
    "天津卫视,http://8.8.8.8:8/udp/239.76.246.185:1234", "深圳卫视,http://8.8.8.8:8/udp/239.76.246.188:1234",
    "湖北卫视,http://8.8.8.8:8/udp/239.76.246.193:1234", "山东卫视,http://8.8.8.8:8/udp/239.76.246.195:1234",
    "黑龙江卫视,http://8.8.8.8:8/udp/239.76.246.200:1234", "吉林卫视,http://8.8.8.8:8/udp/239.76.246.201:1234",
    "河南卫视,http://8.8.8.8:8/udp/239.76.246.202:1234", "海南卫视,http://8.8.8.8:8/udp/239.76.246.203:1234",
    "四川卫视,http://8.8.8.8:8/udp/239.76.246.91:1234", "重庆卫视,http://8.8.8.8:8/udp/239.76.246.92:1234",
    "甘肃卫视,http://8.8.8.8:8/udp/239.76.246.94:1234", "中国教育,http://8.8.8.8:8/udp/239.76.245.192:1234",
    "长沙女姓,http://8.8.8.8:8/udp/239.76.245.23:1234", "长沙影视,http://8.8.8.8:8/udp/239.76.245.204:1234",
    "湘西综合,http://8.8.8.8:8/udp/239.76.245.208:1234", "湘西综合,http://8.8.8.8:8/udp/239.76.245.209:1234",
    "河南梨园,http://8.8.8.8:8/udp/239.76.245.179:1234", "武术世界,http://8.8.8.8:8/udp/239.76.245.181:1234",
    "张家界,http://8.8.8.8:8/udp/239.76.245.235:1234", "张家界综合,http://8.8.8.8:8/udp/239.76.245.234:1234",
    "CHC动作电影,http://8.8.8.8:8/udp/239.76.245.243:1234", "CHC高清电影,http://8.8.8.8:8/udp/239.76.245.242:1234",
    "CHC家庭影院,http://8.8.8.8:8/udp/239.76.245.241:1234", "快乐垂钓,http://8.8.8.8:8/udp/239.76.246.5:1234",
    "凤凰资讯,http://8.8.8.8:8/udp/239.76.246.8:1234", "凤凰中文,http://8.8.8.8:8/udp/239.76.246.7:1234",
    "湖南卫视,http://8.8.8.8:8/udp/239.76.246.101:1234", "湖南卫视,http://8.8.8.8:8/udp/239.76.246.100:1234",
    "湖南经视,http://8.8.8.8:8/udp/239.76.246.103:1234", "湖南国际,http://8.8.8.8:8/udp/239.76.246.102:1234",
    "湖南都市,http://8.8.8.8:8/udp/239.76.246.104:1234", "湖南娱乐,http://8.8.8.8:8/udp/239.76.246.105:1234",
    "湖南电影,http://8.8.8.8:8/udp/239.76.246.106:1234", "湖南公共,http://8.8.8.8:8/udp/239.76.246.109:1234",
    "湖南电视剧,http://8.8.8.8:8/udp/239.76.246.108:1234", "金鹰卡通,http://8.8.8.8:8/udp/239.76.246.107:1234",
    "金鹰纪实,http://8.8.8.8:8/udp/239.76.246.110:1234", "长沙政法,http://8.8.8.8:8/udp/239.76.246.122:1234",
    "长沙新闻,http://8.8.8.8:8/udp/239.76.246.121:1234", "健康电视,http://8.8.8.8:8/udp/239.76.246.127:1234",
    "欢笑剧场4K,http://8.8.8.8:8/udp/239.76.246.130:1234", "都市剧场,http://8.8.8.8:8/udp/239.76.246.215:1234",
    "极速汽车,http://8.8.8.8:8/udp/239.76.246.133:1234", "动漫秀场,http://8.8.8.8:8/udp/239.76.246.131:1234",
    "游戏风云,http://8.8.8.8:8/udp/239.76.246.132:1234", "凤凰中文,http://8.8.8.8:8/udp/239.76.246.134:1234",
    "凤凰中文,http://8.8.8.8:8/udp/239.76.253.135:9000", "凤凰资讯,http://8.8.8.8:8/udp/239.76.253.134:9000",
    "凤凰资讯,http://8.8.8.8:8/udp/239.76.246.135:1234", "体育,http://8.8.8.8:8/udp/239.76.253.136:9000",
    "全纪实,http://8.8.8.8:8/udp/239.76.246.137:1234", "法治天地,http://8.8.8.8:8/udp/239.76.246.138:1234",
    "生活时尚,http://8.8.8.8:8/udp/239.76.246.223:1234", "浏阳新闻,http://8.8.8.8:8/udp/239.76.248.6:1234",
    "常德综合,http://8.8.8.8:8/udp/239.76.248.10:1234", "常德公共,http://8.8.8.8:8/udp/239.76.248.11:1234",
    "衡阳综合,http://8.8.8.8:8/udp/239.76.248.13:1234", "衡阳公共,http://8.8.8.8:8/udp/239.76.248.14:1234",
    "娄底综合,http://8.8.8.8:8/udp/239.76.248.18:1234", "娄底公共,http://8.8.8.8:8/udp/239.76.248.19:1234",
    "张家界综合,http://8.8.8.8:8/udp/239.76.252.234:9000", "张家界,http://8.8.8.8:8/udp/239.76.252.235:9000",
    "邵阳新闻,http://8.8.8.8:8/udp/239.76.248.23:1234", "永州新闻,http://8.8.8.8:8/udp/239.76.248.57:1234",
    "怀化综合,http://8.8.8.8:8/udp/239.76.255.12:9000", "金色夕阳,http://8.8.8.8:8/udp/239.76.254.43:9000",
    "CCTV第一剧场,http://8.8.8.8:8/udp/239.76.254.49:9000", "CCTV风云足球,http://8.8.8.8:8/udp/239.76.254.52:9000",
    "CCTV风云音乐,http://8.8.8.8:8/udp/239.76.254.51:9000", "CCTV风云剧场,http://8.8.8.8:8/udp/239.76.254.50:9000",
    "CCTV女姓时尚,http://8.8.8.8:8/udp/239.76.254.55:9000", "CCTV央视文化精品,http://8.8.8.8:8/udp/239.76.254.56:9000",
    "CCTV世界地理,http://8.8.8.8:8/udp/239.76.254.57:9000", "CCTV兵器科技,http://8.8.8.8:8/udp/239.76.254.59:9000",
    "CCTV央视台球,http://8.8.8.8:8/udp/239.76.254.58:9000", "CCTV怀旧剧场,http://8.8.8.8:8/udp/239.76.254.53:9000",
    "CCTV电视指南,http://8.8.8.8:8/udp/239.76.254.61:9000", "CCTV央视高尔夫,http://8.8.8.8:8/udp/239.76.254.62:9000",
    "北京少儿,http://8.8.8.8:8/udp/239.76.254.81:9000", "快乐垂钓,http://8.8.8.8:8/udp/239.76.253.5:9000",
    "湖南卫视,http://8.8.8.8:8/udp/239.76.253.101:9000", "湖南国际,http://8.8.8.8:8/udp/239.76.253.102:9000",
    "湖南卫视,http://8.8.8.8:8/udp/239.76.253.100:9000", "湖南经视,http://8.8.8.8:8/udp/239.76.253.103:9000",
    "湖南都市,http://8.8.8.8:8/udp/239.76.253.104:9000", "湖南娱乐,http://8.8.8.8:8/udp/239.76.253.105:9000",
    "湖南电影,http://8.8.8.8:8/udp/239.76.253.106:9000", "湖南电视剧,http://8.8.8.8:8/udp/239.76.253.108:9000",
    "金鹰卡通,http://8.8.8.8:8/udp/239.76.253.107:9000", "湖南公共,http://8.8.8.8:8/udp/239.76.253.109:9000",
    "金鹰纪实,http://8.8.8.8:8/udp/239.76.253.110:9000", "长沙新闻,http://8.8.8.8:8/udp/239.76.253.121:9000",
    "长沙政法,http://8.8.8.8:8/udp/239.76.253.122:9000", "欢笑剧场4K,http://8.8.8.8:8/udp/239.76.253.130:9000",
    "极速汽车,http://8.8.8.8:8/udp/239.76.253.133:9000", "动漫秀场,http://8.8.8.8:8/udp/239.76.253.131:9000",
    "凤凰中文,http://8.8.8.8:8/udp/239.76.253.135:9000", "凤凰资讯,http://8.8.8.8:8/udp/239.76.253.134:9000",
    "体育,http://8.8.8.8:8/udp/239.76.253.136:9000", "全纪实,http://8.8.8.8:8/udp/239.76.253.137:9000",
    "金色学堂,http://8.8.8.8:8/udp/239.76.253.139:9000", "法治天地,http://8.8.8.8:8/udp/239.76.253.138:9000",
    "CCTV1,http://8.8.8.8:8/udp/239.76.253.151:9000", "CCTV2,http://8.8.8.8:8/udp/239.76.253.152:9000",
    "CCTV3,http://8.8.8.8:8/udp/239.76.253.153:9000", "CCTV4,http://8.8.8.8:8/udp/239.76.253.154:9000",
    "CCTV5,http://8.8.8.8:8/udp/239.76.253.155:9000", "CCTV5+,http://8.8.8.8:8/udp/239.76.253.168:9000",
    "CCTV6,http://8.8.8.8:8/udp/239.76.253.156:9000", "CCTV7,http://8.8.8.8:8/udp/239.76.253.157:9000",
    "CCTV8,http://8.8.8.8:8/udp/239.76.253.158:9000", "CCTV9,http://8.8.8.8:8/udp/239.76.253.159:9000",
    "CCTV10,http://8.8.8.8:8/udp/239.76.253.160:9000", "CCTV12,http://8.8.8.8:8/udp/239.76.253.162:9000",
    "CCTV13,http://8.8.8.8:8/udp/239.76.253.93:9000", "CCTV14,http://8.8.8.8:8/udp/239.76.253.164:9000",
    "CCTV16,http://8.8.8.8:8/udp/239.76.253.98:9000", "CCTV16 4K,http://8.8.8.8:8/udp/239.76.253.214:9000",
    "CCTV16 4K,http://8.8.8.8:8/udp/239.76.254.200:9000", "CCTV16 4K,http://8.8.8.8:8/udp/239.76.253.224:9000",
    "CCTV16 4K,http://8.8.8.8:8/udp/239.76.253.230:9000", "江苏卫视,http://8.8.8.8:8/udp/239.76.253.181:9000",
    "浙江卫视,http://8.8.8.8:8/udp/239.76.253.182:9000", "北京卫视,http://8.8.8.8:8/udp/239.76.253.184:9000",
    "天津卫视,http://8.8.8.8:8/udp/239.76.253.185:9000", "东方卫视,http://8.8.8.8:8/udp/239.76.253.186:9000",
    "深圳卫视,http://8.8.8.8:8/udp/239.76.253.188:9000", "湖北卫视,http://8.8.8.8:8/udp/239.76.253.193:9000",
    "山东卫视,http://8.8.8.8:8/udp/239.76.253.195:9000", "黑龙江卫视,http://8.8.8.8:8/udp/239.76.253.200:9000",
    "吉林卫视,http://8.8.8.8:8/udp/239.76.253.201:9000", "河南卫视,http://8.8.8.8:8/udp/239.76.253.202:9000",
    "海南卫视,http://8.8.8.8:8/udp/239.76.253.203:9000", "四川卫视,http://8.8.8.8:8/udp/239.76.253.91:9000",
    "重庆卫视,http://8.8.8.8:8/udp/239.76.253.92:9000", "广西卫视,http://8.8.8.8:8/udp/239.76.254.54:9000",
    "陕西卫视,http://8.8.8.8:8/udp/239.76.254.76:9000", "云南卫视,http://8.8.8.8:8/udp/239.76.254.60:9000",
    "青海卫视,http://8.8.8.8:8/udp/239.76.254.132:9000", "甘肃卫视,http://8.8.8.8:8/udp/239.76.253.94:9000",
    "都市剧场,http://8.8.8.8:8/udp/239.76.253.215:9000", "生活时尚,http://8.8.8.8:8/udp/239.76.253.223:9000",
    "长沙女姓,http://8.8.8.8:8/udp/239.76.252.23:9000", "湖南卫视,http://8.8.8.8:8/udp/239.76.252.115:9000",
    "湖南经视,http://8.8.8.8:8/udp/239.76.252.116:9000", "湖南电视剧,http://8.8.8.8:8/udp/239.76.252.118:9000",
    "湖南电影,http://8.8.8.8:8/udp/239.76.252.119:9000", "金鹰卡通,http://8.8.8.8:8/udp/239.76.252.120:9000",
    "湖南公共,http://8.8.8.8:8/udp/239.76.252.123:9000", "湖南娱乐,http://8.8.8.8:8/udp/239.76.252.121:9000",
    "金鹰纪实,http://8.8.8.8:8/udp/239.76.252.122:9000", "湖南国际,http://8.8.8.8:8/udp/239.76.252.124:9000",
    "湖南都市,http://8.8.8.8:8/udp/239.76.252.117:9000", "快乐垂钓,http://8.8.8.8:8/udp/239.76.252.127:9000",
    "河南梨园,http://8.8.8.8:8/udp/239.76.252.179:9000", "文物宝库,http://8.8.8.8:8/udp/239.76.252.180:9000",
    "武术世界,http://8.8.8.8:8/udp/239.76.252.181:9000", "广东卫视,http://8.8.8.8:8/udp/239.76.252.189:9000",
    "东南卫视,http://8.8.8.8:8/udp/239.76.252.190:9000", "中国教育,http://8.8.8.8:8/udp/239.76.252.192:9000",
    "安徽卫视,http://8.8.8.8:8/udp/239.76.252.196:9000", "辽宁卫视,http://8.8.8.8:8/udp/239.76.252.197:9000",
    "河北卫视,http://8.8.8.8:8/udp/239.76.252.199:9000", "贵州卫视,http://8.8.8.8:8/udp/239.76.252.198:9000",
    "长沙影视,http://8.8.8.8:8/udp/239.76.252.204:9000", "湘西综合,http://8.8.8.8:8/udp/239.76.252.208:9000",
    "湘西公共,http://8.8.8.8:8/udp/239.76.252.209:9000", "湘西公共,http://8.8.8.8:8/udp/239.76.252.210:9000",
    "湖南教育,http://8.8.8.8:8/udp/239.76.252.233:9000", "浏阳新闻,http://8.8.8.8:8/udp/239.76.255.6:9000",
    "湘西公共,http://8.8.8.8:8/udp/239.76.252.209:9000", "湘西公共,http://8.8.8.8:8/udp/239.76.252.210:9000",
    "湘西综合,http://8.8.8.8:8/udp/239.76.252.208:9000", "湘西综合,http://8.8.8.8:8/udp/239.76.245.208:1234",
    "衡阳公共,http://8.8.8.8:8/udp/239.76.255.14:9000", "衡阳综合,http://8.8.8.8:8/udp/239.76.255.13:9000",
    "衡阳县电视台,http://8.8.8.8:8/udp/239.76.255.26:9000", "邵阳公共,http://8.8.8.8:8/udp/239.76.255.22:9000",
    "邵阳综合,http://8.8.8.8:8/udp/239.76.255.21:9000", "娄底教育,http://8.8.8.8:8/udp/239.76.255.20:9000",
    "娄底综合,http://8.8.8.8:8/udp/239.76.255.18:9000", "娄底公共,http://8.8.8.8:8/udp/239.76.255.19:9000",
    "郴州综合,http://8.8.8.8:8/udp/239.76.253.75:9000", "张家界综合,http://8.8.8.8:8/udp/239.76.252.234:9000",
    "张家界公共,http://8.8.8.8:8/udp/239.76.252.235:9000", "怀化综合,http://8.8.8.8:8/udp/239.76.255.12:9000",
    "常德综合,http://8.8.8.8:8/udp/239.76.255.10:9000", "常德公共,http://8.8.8.8:8/udp/239.76.255.11:9000",
    "永州综合,http://8.8.8.8:8/udp/239.76.255.23:9000", "溆浦综合,http://8.8.8.8:8/udp/239.76.255.25:9000",
    "武冈综合,http://8.8.8.8:8/udp/239.76.255.29:9000", "新化,http://8.8.8.8:8/udp/239.76.255.31:9000",
    "津市,http://8.8.8.8:8/udp/239.76.255.30:9000", "桂东融媒,http://8.8.8.8:8/udp/239.76.253.231:9000",
    "道县综合,http://8.8.8.8:8/udp/239.76.255.28:9000", "永州公共,http://8.8.8.8:8/udp/239.76.255.24:9000",
    "株洲公共,http://8.8.8.8:8/udp/239.76.252.236:9000", "株洲综合,http://8.8.8.8:8/udp/239.76.255.1:9000",
    "湘潭公共,http://8.8.8.8:8/udp/239.76.255.5:9000", "湘潭综合,http://8.8.8.8:8/udp/239.76.255.4:9000",
    "益阳公共,http://8.8.8.8:8/udp/239.76.255.16:9000", "益阳综合,http://8.8.8.8:8/udp/239.76.255.15:9000",
    "岳阳综合,http://8.8.8.8:8/udp/239.76.255.7:9000", "岳阳科教,http://8.8.8.8:8/udp/239.76.255.9:9000",
    "岳阳公共,http://8.8.8.8:8/udp/239.76.255.8:9000",
]

# 处理URL和频道的函数
def fetch_urls_and_channels(urls, channelsx, region):
    results = []
    urls_all = []
    
    for url in urls:
        if region == "北京":
            url_0 = str(base64.b64encode((f'"Rozhuk" && city="{url}" && org="China Unicom Beijing Province Network"').encode("utf-8")), "utf-8")
        elif region == "湖南":
            url_0 = str(base64.b64encode((f'"Rozhuk" && city="{url}" && org="Chinanet"').encode("utf-8")), "utf-8")
        
        url_64 = f'https://fofa.info/result?qbase64={url_0}'
        print(url_64)
        
        try:
            response = requests.get(url_64, headers=headers, timeout=15)
            page_content = response.text
            print(f" {url} 访问成功")
            pattern = r'href="(http://\d+\.\d+\.\d+\.\d+:\d+)"'
            page_urls = re.findall(pattern, page_content)

            for urlx in page_urls:
                try:
                    response = requests.get(url=urlx + '/stat', timeout=1)
                    response.raise_for_status()  # 返回状态码不是200异常
                    page_content = response.text
                    pattern = r'connections online'
                    page_proctabl = re.findall(pattern, page_content)
                    if page_proctabl:
                        urls_all.append(urlx)
                        print(f"{urlx} 可以访问")
                except requests.RequestException:
                    pass
        except Exception:
            print(f"{url_64} 访问失败")
            pass

    urls_all = set(urls_all)  # 去重得到唯一的URL列表
    for urlx in urls_all:
        channel = [f'{name},{url.replace("http://8.8.8.8:8", urlx)}' for name, url in
                   [line.strip().split(',') for line in channelsx]]
        results.extend(channel)

    return sorted(results)

# 获取北京和湖南的频道
results_beijing = fetch_urls_and_channels(urls_beijing, channelsx_beijing, "北京")
results_hunan = fetch_urls_and_channels(urls_hunan, channelsx_hunan, "湖南")

# 合并结果
results = results_beijing + results_hunan
resultsx = []
error_channels = []

# 定义工作线程函数
def worker():
    while True:
        result = task_queue.get()
        if result is None:
            break  # 终止线程的信号

        channel_name, channel_url = result.split(',', 1)
        try:
            # 尝试用 OpenCV 打开视频流
            cap = cv2.VideoCapture(channel_url)
            
            # 等待一段时间以确保视频流可以开始
            if not cap.isOpened():
                raise Exception("无法打开视频流")
            
            # 尝试读取视频流的第一帧
            ret, frame = cap.read()
            if not ret:
                raise Exception("无法读取视频流")

            # 如果成功读取到帧，说明视频流有效
            resultsx.append((channel_name, channel_url))
            cap.release()
            
            numberx = (len(resultsx) + len(error_channels)) / len(results) * 100
            print(f"可用频道：{len(resultsx)} , 不可用频道：{len(error_channels)} 个 , 总频道：{len(results)} 个 , 总进度：{numberx:.2f} %。")
        
        except Exception:
            # 如果出现任何错误，记录到错误频道列表中
            error_channels.append(result)
            numberx = (len(resultsx) + len(error_channels)) / len(results) * 100
            print(f"可用频道：{len(resultsx)} 个 , 不可用频道：{len(error_channels)} 个 , 总频道：{len(results)} 个 , 总进度：{numberx:.2f} %。")
        finally:
            task_queue.task_done()

# 创建多个工作线程
num_threads = 20
for _ in range(num_threads):
    t = threading.Thread(target=worker, daemon=True)
    t.start()

# 添加下载任务到队列
for result in results:
    task_queue.put(result)

# 等待所有任务完成
task_queue.join()

# 对频道进行排序
resultxs.sort(key=lambda x: int(re.search(r'\d+', x[0]).group()) if re.search(r'\d+', x[0]) else float('inf'))

result_counter = 10  # 每个频道需要的个数

with open("iptv_list.txt", 'w', encoding='utf-8') as file:
    channel_counters = {}
    file.write('央视频道,#genre#\n')
    
    for result in resultxs:
        channel_name, channel_url = result
        if 'CCTV' in channel_name:
            if channel_name in channel_counters:
                if channel_counters[channel_name] >= result_counter:
                    continue
                else:
                    file.write(f"{channel_name},{channel_url}\n")
                    channel_counters[channel_name] += 1
            else:
                file.write(f"{channel_name},{channel_url}\n")
                channel_counters[channel_name] = 1

    file.write('\n卫视频道,#genre#\n')
    channel_counters.clear()
    for result in resultxs:
        channel_name, channel_url = result
        if '卫视' in channel_name or '凤凰' in channel_name or 'CHC' in channel_name:
            if channel_name in channel_counters:
                if channel_counters[channel_name] >= result_counter:
                    continue
                else:
                    file.write(f"{channel_name},{channel_url}\n")
                    channel_counters[channel_name] += 1
            else:
                file.write(f"{channel_name},{channel_url}\n")
                channel_counters[channel_name] = 1

    file.write('\n湖南频道,#genre#\n')
    channel_counters.clear()
    for result in resultxs:
        channel_name, channel_url = result
        if any(keyword in channel_name for keyword in ['湖南', '长沙', '金鹰', '娄底', '常德', '张家界', '怀化', 
                                                       '浏阳', '湘西', '衡阳', '邵阳', '郴州', '岳阳', '溆浦', 
                                                       '武冈', '新化', '津市', '桂东', '道县', '永州', '株洲', '湘潭', '益阳']):
            if channel_name in channel_counters:
                if channel_counters[channel_name] >= result_counter:
                    continue
                else:
                    file.write(f"{channel_name},{channel_url}\n")
                    channel_counters[channel_name] += 1
            else:
                file.write(f"{channel_name},{channel_url}\n")
                channel_counters[channel_name] = 1
